================================================================================
Simple definition with period
================================================================================

square == dup *.

--------------------------------------------------------------------------------

(source_file
  (definition
    name: (symbol)
    body: (symbol)
    body: (operator)))

================================================================================
Simple definition with semicolon
================================================================================

square == dup *;

--------------------------------------------------------------------------------

(source_file
  (definition
    name: (symbol)
    body: (symbol)
    body: (operator)))

================================================================================
Multiple definitions
================================================================================

double == 2 *.
triple == 3 *.

--------------------------------------------------------------------------------

(source_file
  (definition
    name: (symbol)
    body: (integer)
    body: (operator))
  (definition
    name: (symbol)
    body: (integer)
    body: (operator)))

================================================================================
Definition with quotation
================================================================================

apply-twice == dup [app] dip app.

--------------------------------------------------------------------------------

(source_file
  (definition
    name: (symbol)
    body: (symbol)
    body: (quotation
      (symbol))
    body: (symbol)
    body: (symbol)))
