================================================================================
Integer literals
================================================================================

42. -17. 0. 123456789.

--------------------------------------------------------------------------------

(source_file
  (statement
    (integer))
  (statement
    (integer))
  (statement
    (integer))
  (statement
    (integer)))

================================================================================
Float literals
================================================================================

3.14. -2.5. 1.0. 0.001.

--------------------------------------------------------------------------------

(source_file
  (statement
    (float))
  (statement
    (float))
  (statement
    (float))
  (statement
    (float)))

================================================================================
Character literals
================================================================================

'A. 'x. '0.

--------------------------------------------------------------------------------

(source_file
  (statement
    (character))
  (statement
    (character))
  (statement
    (character)))

================================================================================
String literals
================================================================================

"hello". "world\n". "".

--------------------------------------------------------------------------------

(source_file
  (statement
    (string))
  (statement
    (string))
  (statement
    (string)))

================================================================================
Boolean literals
================================================================================

true. false.

--------------------------------------------------------------------------------

(source_file
  (statement
    (boolean))
  (statement
    (boolean)))

================================================================================
Null literal
================================================================================

null.

--------------------------------------------------------------------------------

(source_file
  (statement
    (null)))
