================================================================================
Empty quotation
================================================================================

[].

--------------------------------------------------------------------------------

(source_file
  (statement
    (quotation)))

================================================================================
Simple quotation
================================================================================

[1 2 3].

--------------------------------------------------------------------------------

(source_file
  (statement
    (quotation
      (integer)
      (integer)
      (integer))))

================================================================================
Nested quotation
================================================================================

[[1 2] [3 4]].

--------------------------------------------------------------------------------

(source_file
  (statement
    (quotation
      (quotation
        (integer)
        (integer))
      (quotation
        (integer)
        (integer)))))

================================================================================
Quotation with operators
================================================================================

[dup * +].

--------------------------------------------------------------------------------

(source_file
  (statement
    (quotation
      (symbol)
      (operator)
      (operator))))

================================================================================
Cons pattern in quotation
================================================================================

[h : t].

--------------------------------------------------------------------------------

(source_file
  (statement
    (quotation
      (symbol)
      (cons_operator)
      (symbol))))
